// 1)შექმენით ერთ განზომილებიანი მსაივი საიდანაც for ციკლის მეშვებოთ დაბეჭდავთ მასივში არსებულ ყველა ელემენტს


// var numbers = [15,53,22,198,10,28,16,70,33,951];
// for (var i=0; i < numbers.length; i++) {
//     console.log(numbers[i])
// }

// {
//    document.write(numbers[i]);
// }




// 2)შექმენიტ
// ფუნქცია სადაც ერთ ფუნქციას გამოიყენებთ მოერე ფუნქციის პარამეტრად და if
// else მეშვეობით დაბეჭდეთ რამე ინფორმაცია (მაგ: თუ რამე ნივთის ფასი
// მაღაზიაში არის 50 ლარზე მეტი ესეიგი ძვირია თუ 20-50 დიაპაზონშია მოქცეული
// საშუალო თუ ნაკლები იაფი)

var price = prompt("ნივთის ფასი");

if (price >50) {
    alert ("ძვირია")
} 
else if (price >= 20 && price <=50) {
    alert ("საშუალო")
}
else if (price < 20) {
    alert ("იაფი")
}
console.log(price)




// 3) მოცემული მასივიდან [ 15,53,22,198,10,28,16,70,33,951 ] დაბეჭდეთ მხოლოდ კენტი რიცხვები

// ვიდეო მასალა

// https://www.youtube.com/watch?v=xjAu2Y2nJ34